docs: add system architecture
